#include <iostream>
#include <windows.h>

int portion_cnt = 1; ///< количество порций
int cooking_time_min = 7; ///< время приготовления в минутах
int ready_portion_cnt = 0; ///< количество готовых порций

int main()
{
    // переключаем раскладку вывода на UTF8, 
    // потому что исходный текст у меня в UTF8 и в нем есть русские буквы.
    SetConsoleOutputCP(CP_UTF8);
    
    std::cout << "Рецепт: Яичница в хлебе на сковороде\n"
              << "Кол-во порций: " << portion_cnt << "\n"
              << "Время приготовления: " << cooking_time_min << "  минут\n"
              << "Готовых порций в начале: " << ready_portion_cnt << "\n"
              << "Ингредиенты:" << "\n"
              << "  - Хлеб (1 толстый ломтик)" << "\n"
              << "  - Яйцо (1 шт.)" << "\n"
              << "  - Сливочное масло (1 чайная ложка)" << "\n"
              << "  - Соль и специи (по вкусу)" << "\n"
              << "Пошаговый рецепт:" << "\n"
              << "1. В центре хлеба сделайте отверстие." << "\n"
              << "2. Разогрейте сковороду с маслом." << "\n"
              << "3. Обжарьте хлеб в течение 30 секунд." << "\n"
              << "4. Добавьте яйцо прямо в середину хлебного отверстия." << "\n"
              << "5. Жарьте около 5 минут" << "\n";

    ready_portion_cnt = portion_cnt;
    
    std::cout << "Готово порций: " << ready_portion_cnt << "\n";
    return 0;
}
